#    -*- mode: org -*-


Archived entries from file /home/kirang/Documents/research/suslik-ocaml-writeup/ocaml/todo.org


* DONE Read through SLING To work out why it outputs such poor invariants
CLOSED: [2022-10-06 Thu 06:53]
:PROPERTIES:
:Effort:   0:10
:ARCHIVE_TIME: 2022-10-07 Fri 10:27
:ARCHIVE_FILE: ~/Documents/research/suslik-ocaml-writeup/ocaml/todo.org
:ARCHIVE_OLPATH: Tasks for the PROOF GOD
:ARCHIVE_CATEGORY: todo
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2022-10-06 Thu 06:34]--[2022-10-06 Thu 06:53] =>  0:19
:END:

* DONE Prove array find map
CLOSED: [2022-10-07 Fri 04:10]
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2022-10-10 Mon 07:01
:ARCHIVE_FILE: ~/Documents/research/suslik-ocaml-writeup/ocaml/todo.org
:ARCHIVE_OLPATH: Tasks for the PROOF GOD/Work on array find map
:ARCHIVE_CATEGORY: todo
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2022-10-07 Fri 03:58]--[2022-10-07 Fri 04:10] =>  0:12
:END:

* DONE Setup unit tests for array find mapi
CLOSED: [2022-10-07 Fri 10:27]
:PROPERTIES:
:ARCHIVE_TIME: 2022-10-10 Mon 07:01
:ARCHIVE_FILE: ~/Documents/research/suslik-ocaml-writeup/ocaml/todo.org
:ARCHIVE_OLPATH: Tasks for the PROOF GOD/Work on array find map
:ARCHIVE_CATEGORY: todo
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2022-10-07 Fri 06:04]--[2022-10-07 Fri 10:22] =>  4:18
:END:

* DONE Update Dune file to work more nicely across projects
CLOSED: [2022-10-06 Thu 13:26]
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2022-10-13 Thu 02:44
:ARCHIVE_FILE: ~/Documents/research/suslik-ocaml-writeup/ocaml/todo.org
:ARCHIVE_OLPATH: Tasks for the PROOF GOD
:ARCHIVE_CATEGORY: todo
:ARCHIVE_TODO: DONE
:END:
:LOGBOOK:
CLOCK: [2022-10-06 Thu 07:41]--[2022-10-07 Fri 06:04] => 22:23
CLOCK: [2022-10-06 Thu 07:03]--[2022-10-06 Thu 07:30] =>  0:27
:END:

** DONE Add support for xif lemma in proof analysis
CLOSED: [2022-10-11 Tue 03:23]
:LOGBOOK:
CLOCK: [2022-10-11 Tue 03:23]--[2022-10-11 Tue 03:23] =>  0:00
CLOCK: [2022-10-11 Tue 02:29]--[2022-10-11 Tue 03:23] =>  0:54
:END:
